# GIT - распределяет система контроля версий.
# это система для отслеживание и ведения истории изменения файлов б в вашем проекте

# Репозиторий - хранилище вашего кода и его изменения

# GitHub - веб сайт для размещения git - репозиторий и совместной разработки

# Команды  Git

# 1. git init - она создает новый гит репозитори локальной на ваше пк

# 2. git commit - как только мы достигаем определенного момента в разработке,
# то когда мы сохраняем и комментируем изменения.
# (фиксация измнения в репо)
# git commit -m '<comment>'

# 3. git add - когда мы создаем или измняем файлы,
# то при помощи этой команды мы закружаем все изменения в локальной хранилизеще

# git add <названия файла>
# git add .

# 4. git remote add - это команда для того чтобы связать ваш проект с удаленным репозиторием (репо в гитхабе)

# git remote add <название подключения> <ссылка на репо>

# git remote add origin <url>

# 5. git push - после коммита изменений при помощи этой команды мы отправляем наши изменнения на удаленый репозиторий

# git push <названия наши ветки>

